In [1]:
%matplotlib inline

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=range(6), columns=list('ABCD'))
df

          A         B         C         D
0  0.551186 -1.069023 -1.607758  0.560195
1  0.091608  0.951908 -0.439382 -0.442588
2  0.297956 -0.194177  1.171773  1.859732
3 -0.553572  1.261971 -2.304773  1.173981
4  0.215731 -0.718136  0.281183 -1.575456
5 -0.226384 -0.860336 -0.089046 -1.438389

In [8]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3]*4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.head()

          A         B         C         D
0  0.551186 -1.069023 -1.607758  0.560195
1  0.091608  0.951908 -0.439382 -0.442588
2  0.297956 -0.194177  1.171773  1.859732
3 -0.553572  1.261971 -2.304773  1.173981
4  0.215731 -0.718136  0.281183 -1.575456

In [12]:
df.tail()

          A         B         C         D
1  0.091608  0.951908 -0.439382 -0.442588
2  0.297956 -0.194177  1.171773  1.859732
3 -0.553572  1.261971 -2.304773  1.173981
4  0.215731 -0.718136  0.281183 -1.575456
5 -0.226384 -0.860336 -0.089046 -1.438389

In [13]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.062754 -0.104632 -0.498000  0.022913
std    0.395368  0.986856  1.269798  1.406727
min   -0.553572 -1.069023 -2.304773 -1.575456
25%   -0.146886 -0.824786 -1.315664 -1.189439
50%    0.153670 -0.456157 -0.264214  0.058803
75%    0.277400  0.665387  0.188626  1.020534
max    0.551186  1.261971  1.171773  1.859732

In [16]:
df.describe().T

   count      mean       std       min       25%       50%       75%       max
A    6.0  0.062754  0.395368 -0.553572 -0.146886  0.153670  0.277400  0.551186
B    6.0 -0.104632  0.986856 -1.069023 -0.824786 -0.456157  0.665387  1.261971
C    6.0 -0.498000  1.269798 -2.304773 -1.315664 -0.264214  0.188626  1.171773
D    6.0  0.022913  1.406727 -1.575456 -1.189439  0.058803  1.020534  1.859732

In [17]:
df.sort_index(axis=1, ascending=False)

          D         C         B         A
0  0.560195 -1.607758 -1.069023  0.551186
1 -0.442588 -0.439382  0.951908  0.091608
2  1.859732  1.171773 -0.194177  0.297956
3  1.173981 -2.304773  1.261971 -0.553572
4 -1.575456  0.281183 -0.718136  0.215731
5 -1.438389 -0.089046 -0.860336 -0.226384

In [18]:
df.sort_values(by='B')

          A         B         C         D
0  0.551186 -1.069023 -1.607758  0.560195
5 -0.226384 -0.860336 -0.089046 -1.438389
4  0.215731 -0.718136  0.281183 -1.575456
2  0.297956 -0.194177  1.171773  1.859732
1  0.091608  0.951908 -0.439382 -0.442588
3 -0.553572  1.261971 -2.304773  1.173981

In [19]:
df['A']

0    0.551186
1    0.091608
2    0.297956
3   -0.553572
4    0.215731
5   -0.226384
Name: A, dtype: float64

In [20]:
df[0:3]

          A         B         C         D
0  0.551186 -1.069023 -1.607758  0.560195
1  0.091608  0.951908 -0.439382 -0.442588
2  0.297956 -0.194177  1.171773  1.859732

In [22]:
df.loc[1]

A    0.091608
B    0.951908
C   -0.439382
D   -0.442588
Name: 1, dtype: float64

In [23]:
df.loc[:, ['A', 'B']]

          A         B
0  0.551186 -1.069023
1  0.091608  0.951908
2  0.297956 -0.194177
3 -0.553572  1.261971
4  0.215731 -0.718136
5 -0.226384 -0.860336

In [24]:
df.loc[1:3, ['A', 'C']]

          A         C
1  0.091608 -0.439382
2  0.297956  1.171773
3 -0.553572 -2.304773

In [25]:
df.loc[1,['A']]

A    0.091608
Name: 1, dtype: float64

In [27]:
df.at[1,'A']#获取坐标具体的值

0.0916081341503513

In [28]:
df.at[1, ['A', 'B']]

TypeError: unhashable type: 'list'

In [29]:
df.iloc[3]

A   -0.553572
B    1.261971
C   -2.304773
D    1.173981
Name: 3, dtype: float64

In [30]:
df.iloc[1:3, :]

          A         B         C         D
1  0.091608  0.951908 -0.439382 -0.442588
2  0.297956 -0.194177  1.171773  1.859732

In [31]:
df.iloc[1,1]

0.9519078432635341

In [32]:
df[df.A > 0]

          A         B         C         D
0  0.551186 -1.069023 -1.607758  0.560195
1  0.091608  0.951908 -0.439382 -0.442588
2  0.297956 -0.194177  1.171773  1.859732
4  0.215731 -0.718136  0.281183 -1.575456

In [33]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

          A         B         C         D      E
0  0.551186 -1.069023 -1.607758  0.560195    one
1  0.091608  0.951908 -0.439382 -0.442588    one
2  0.297956 -0.194177  1.171773  1.859732    two
3 -0.553572  1.261971 -2.304773  1.173981  three
4  0.215731 -0.718136  0.281183 -1.575456   four
5 -0.226384 -0.860336 -0.089046 -1.438389  three

In [34]:
df2[df2['E'].isin(['two', 'four'])]

          A         B         C         D     E
2  0.297956 -0.194177  1.171773  1.859732   two
4  0.215731 -0.718136  0.281183 -1.575456  four

In [35]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [36]:
df['F'] = s1
df

          A         B         C         D   F
0  0.551186 -1.069023 -1.607758  0.560195 NaN
1  0.091608  0.951908 -0.439382 -0.442588 NaN
2  0.297956 -0.194177  1.171773  1.859732 NaN
3 -0.553572  1.261971 -2.304773  1.173981 NaN
4  0.215731 -0.718136  0.281183 -1.575456 NaN
5 -0.226384 -0.860336 -0.089046 -1.438389 NaN

In [37]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [38]:
df.index = pd.date_range('20130102',periods=6)

In [39]:
df

                   A         B         C         D   F
2013-01-02  0.551186 -1.069023 -1.607758  0.560195 NaN
2013-01-03  0.091608  0.951908 -0.439382 -0.442588 NaN
2013-01-04  0.297956 -0.194177  1.171773  1.859732 NaN
2013-01-05 -0.553572  1.261971 -2.304773  1.173981 NaN
2013-01-06  0.215731 -0.718136  0.281183 -1.575456 NaN
2013-01-07 -0.226384 -0.860336 -0.089046 -1.438389 NaN

In [40]:
df['F'] = s1
df

                   A         B         C         D  F
2013-01-02  0.551186 -1.069023 -1.607758  0.560195  1
2013-01-03  0.091608  0.951908 -0.439382 -0.442588  2
2013-01-04  0.297956 -0.194177  1.171773  1.859732  3
2013-01-05 -0.553572  1.261971 -2.304773  1.173981  4
2013-01-06  0.215731 -0.718136  0.281183 -1.575456  5
2013-01-07 -0.226384 -0.860336 -0.089046 -1.438389  6

In [41]:
dates = pd.date_range('20130102',periods=6)
df.at[dates[0], 'A'] = 0

In [42]:
df

                   A         B         C         D  F
2013-01-02  0.000000 -1.069023 -1.607758  0.560195  1
2013-01-03  0.091608  0.951908 -0.439382 -0.442588  2
2013-01-04  0.297956 -0.194177  1.171773  1.859732  3
2013-01-05 -0.553572  1.261971 -2.304773  1.173981  4
2013-01-06  0.215731 -0.718136  0.281183 -1.575456  5
2013-01-07 -0.226384 -0.860336 -0.089046 -1.438389  6

In [43]:
df.iat[0,1] = 0
df

                   A         B         C         D  F
2013-01-02  0.000000  0.000000 -1.607758  0.560195  1
2013-01-03  0.091608  0.951908 -0.439382 -0.442588  2
2013-01-04  0.297956 -0.194177  1.171773  1.859732  3
2013-01-05 -0.553572  1.261971 -2.304773  1.173981  4
2013-01-06  0.215731 -0.718136  0.281183 -1.575456  5
2013-01-07 -0.226384 -0.860336 -0.089046 -1.438389  6

In [44]:
df.loc[:, ['D']] = np.array([5] * len(df))
df

                   A         B         C  D  F
2013-01-02  0.000000  0.000000 -1.607758  5  1
2013-01-03  0.091608  0.951908 -0.439382  5  2
2013-01-04  0.297956 -0.194177  1.171773  5  3
2013-01-05 -0.553572  1.261971 -2.304773  5  4
2013-01-06  0.215731 -0.718136  0.281183  5  5
2013-01-07 -0.226384 -0.860336 -0.089046  5  6

In [45]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D  F
2013-01-02  0.000000  0.000000 -1.607758 -5 -1
2013-01-03 -0.091608 -0.951908 -0.439382 -5 -2
2013-01-04 -0.297956 -0.194177 -1.171773 -5 -3
2013-01-05 -0.553572 -1.261971 -2.304773 -5 -4
2013-01-06 -0.215731 -0.718136 -0.281183 -5 -5
2013-01-07 -0.226384 -0.860336 -0.089046 -5 -6

In [46]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D  F    E
2013-01-02  0.000000  0.000000 -1.607758  5  1  1.0
2013-01-03  0.091608  0.951908 -0.439382  5  2  1.0
2013-01-04  0.297956 -0.194177  1.171773  5  3  NaN
2013-01-05 -0.553572  1.261971 -2.304773  5  4  NaN

In [48]:
df1.isnull().sum()

A    0
B    0
C    0
D    0
F    0
E    2
dtype: int64

In [49]:
df1.fillna(value=5)

                   A         B         C  D  F    E
2013-01-02  0.000000  0.000000 -1.607758  5  1  1.0
2013-01-03  0.091608  0.951908 -0.439382  5  2  1.0
2013-01-04  0.297956 -0.194177  1.171773  5  3  5.0
2013-01-05 -0.553572  1.261971 -2.304773  5  4  5.0

In [50]:
df1.isnull()

                A      B      C      D      F      E
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False   True
2013-01-05  False  False  False  False  False   True

In [51]:
df.mean()

A   -0.029110
B    0.073538
C   -0.498000
D    5.000000
F    3.500000
dtype: float64

In [52]:
df.mean(axis=1)

2013-01-02    0.878448
2013-01-03    1.520827
2013-01-04    1.855110
2013-01-05    1.480725
2013-01-06    1.955756
2013-01-07    1.964847
Freq: D, dtype: float64

In [53]:
df.mean(axis=0)

A   -0.029110
B    0.073538
C   -0.498000
D    5.000000
F    3.500000
dtype: float64

In [54]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    2
2    1
3    6
4    2
5    1
6    2
7    4
8    1
9    3
dtype: int64

In [55]:
s.value_counts()

2    3
1    3
6    1
5    1
4    1
3    1
dtype: int64

In [56]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [57]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  1.756154  1.177087 -0.053446  0.449274
1  1.195961 -2.806865 -1.720440 -1.045288
2  1.033937 -0.401068  0.268541 -1.269847
3 -2.313078 -1.365388  0.563594 -0.035152
4  0.102219 -0.413467 -0.196531 -0.286885
5  0.285539 -2.055924 -0.350927  1.091001
6  0.869731 -2.547003 -0.052596 -2.050901
7  0.019702 -1.255508  1.113149  0.866846
8 -0.911196  0.878254 -0.302910  0.354903
9  0.045800  1.655911  0.414185 -1.005238

In [58]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.756154  1.177087 -0.053446  0.449274
 1  1.195961 -2.806865 -1.720440 -1.045288
 2  1.033937 -0.401068  0.268541 -1.269847,
           0         1         2         3
 3 -2.313078 -1.365388  0.563594 -0.035152
 4  0.102219 -0.413467 -0.196531 -0.286885
 5  0.285539 -2.055924 -0.350927  1.091001
 6  0.869731 -2.547003 -0.052596 -2.050901,
           0         1         2         3
 7  0.019702 -1.255508  1.113149  0.866846
 8 -0.911196  0.878254 -0.302910  0.354903
 9  0.045800  1.655911  0.414185 -1.005238]

In [59]:
pd.concat(pieces)

          0         1         2         3
0  1.756154  1.177087 -0.053446  0.449274
1  1.195961 -2.806865 -1.720440 -1.045288
2  1.033937 -0.401068  0.268541 -1.269847
3 -2.313078 -1.365388  0.563594 -0.035152
4  0.102219 -0.413467 -0.196531 -0.286885
5  0.285539 -2.055924 -0.350927  1.091001
6  0.869731 -2.547003 -0.052596 -2.050901
7  0.019702 -1.255508  1.113149  0.866846
8 -0.911196  0.878254 -0.302910  0.354903
9  0.045800  1.655911  0.414185 -1.005238

In [60]:
left = pd.DataFrame({'key':['foo', 'foo'], 'lval':[1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [61]:
right = pd.DataFrame({'key':['foo', 'foo'], 'lval':[4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [62]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

In [63]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.665747  1.711160 -0.880484 -2.122118
1 -0.663444 -0.860594 -0.329656  0.475033
2  1.732399  0.025238 -0.429692  0.151664
3  0.459355 -0.771695  1.026184 -0.730954
4 -0.965285  0.167167  1.039882  1.614526
5 -0.111049 -1.194886 -1.808354  1.402759
6  0.063201 -3.007899  0.665858  1.059218
7  0.159037  0.282683 -0.751406 -1.395327

In [64]:
s = df.iloc[3]

In [65]:
s

A    0.459355
B   -0.771695
C    1.026184
D   -0.730954
Name: 3, dtype: float64

In [66]:
df.append(s, ignore_index=True
         )

          A         B         C         D
0  0.665747  1.711160 -0.880484 -2.122118
1 -0.663444 -0.860594 -0.329656  0.475033
2  1.732399  0.025238 -0.429692  0.151664
3  0.459355 -0.771695  1.026184 -0.730954
4 -0.965285  0.167167  1.039882  1.614526
5 -0.111049 -1.194886 -1.808354  1.402759
6  0.063201 -3.007899  0.665858  1.059218
7  0.159037  0.282683 -0.751406 -1.395327
8  0.459355 -0.771695  1.026184 -0.730954

In [67]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 
                          'foo', 'bar', 'foo', 'bar'],
                   'B' : ['one', 'one', 'two', 'three', 
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.142356  1.682558
1  bar    one  1.730127  1.152831
2  foo    two -1.030632  0.026729
3  bar  three  0.395975 -0.085181
4  foo    two  1.228153  0.719057
5  bar    two  1.804490 -1.160509
6  foo    one -0.191119  0.609168
7  bar  three -1.486031  0.922144

In [69]:
A_group = df.groupby('A')

In [70]:
A_group

In [71]:
A_group.sum()

            C         D
A
bar  2.444561  0.829284
foo -0.135954  3.037512

In [72]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    1.730127  1.152831
    three -1.090056  0.836963
    two    1.804490 -1.160509
foo one   -0.333475  2.291726
    two    0.197521  0.745786

In [73]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [74]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [75]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [76]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.733762 -2.154747
      two    -1.099847  0.565482
baz   one    -0.356944 -1.132171
      two     0.513423 -1.920305

In [77]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -0.733762
               B   -2.154747
       two     A   -1.099847
               B    0.565482
baz    one     A   -0.356944
               B   -1.132171
       two     A    0.513423
               B   -1.920305
dtype: float64

In [78]:
stacked.unstack()

                     A         B
first second
bar   one    -0.733762 -2.154747
      two    -1.099847  0.565482
baz   one    -0.356944 -1.132171
      two     0.513423 -1.920305

In [79]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  1.406261 -1.211365
1     one  B  foo  0.284683  0.079998
2     two  C  foo  0.003830 -0.750545
3   three  A  bar -0.225648  1.918847
4     one  B  bar -1.287501 -1.689785
5     one  C  bar -0.280782  0.443105
6     two  A  foo  0.215085 -0.234636
7   three  B  foo  1.020867  0.854295
8     one  C  foo  2.359000  0.308038
9     one  A  bar -0.236376  0.197582
10    two  B  bar  0.575221 -0.438876
11  three  C  bar  2.440562 -1.551781

In [80]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.236376  1.406261
      B -1.287501  0.284683
      C -0.280782  2.359000
three A -0.225648       NaN
      B       NaN  1.020867
      C  2.440562       NaN
two   A       NaN  0.215085
      B  0.575221       NaN
      C       NaN  0.003830

In [81]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [82]:
ts = pd.Series(np.random.randint(0,500,len(rng)), index=rng)
ts

2012-01-01 00:00:00     34
2012-01-01 00:00:01     84
2012-01-01 00:00:02    317
2012-01-01 00:00:03    157
2012-01-01 00:00:04    190
                      ...
2012-01-01 00:01:35     78
2012-01-01 00:01:36     40
2012-01-01 00:01:37    210
2012-01-01 00:01:38     81
2012-01-01 00:01:39    255
Freq: S, Length: 100, dtype: int64

In [83]:
ts.resample('5Min', how='sum')

/Users/super/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: how in .resample() is deprecated
the new syntax is .resample(...).sum()
  """Entry point for launching an IPython kernel.

2012-01-01    23518
Freq: 5T, dtype: int64

In [84]:
rng = pd.date_range('3/6/2012', periods=5, freq='D')
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [85]:
ts = pd.Series(np.random.randn(len(rng)), index = rng)
ts

2012-03-06   -0.890148
2012-03-07    0.016016
2012-03-08    0.215132
2012-03-09   -0.690571
2012-03-10   -0.797683
Freq: D, dtype: float64

In [86]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00   -0.890148
2012-03-07 00:00:00+00:00    0.016016
2012-03-08 00:00:00+00:00    0.215132
2012-03-09 00:00:00+00:00   -0.690571
2012-03-10 00:00:00+00:00   -0.797683
Freq: D, dtype: float64

In [88]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.890148
2012-03-06 19:00:00-05:00    0.016016
2012-03-07 19:00:00-05:00    0.215132
2012-03-08 19:00:00-05:00   -0.690571
2012-03-09 19:00:00-05:00   -0.797683
Freq: D, dtype: float64

In [89]:
rng = pd.date_range('1/1/2020', periods=5, freq = 'M')
rng

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30',
               '2020-05-31'],
              dtype='datetime64[ns]', freq='M')

In [90]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2020-01-31    0.947056
2020-02-29    1.933917
2020-03-31   -1.168172
2020-04-30   -1.103129
2020-05-31    1.351259
Freq: M, dtype: float64

In [91]:
ps = ts.to_period()
ps

2020-01    0.947056
2020-02    1.933917
2020-03   -1.168172
2020-04   -1.103129
2020-05    1.351259
Freq: M, dtype: float64

In [92]:
ps.to_timestamp()

2020-01-01    0.947056
2020-02-01    1.933917
2020-03-01   -1.168172
2020-04-01   -1.103129
2020-05-01    1.351259
Freq: MS, dtype: float64

In [93]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'e', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         e
5   6         e

In [94]:
df["grade"] = df["raw_grade"].astype("category")
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         e     e
5   6         e     e

In [95]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [96]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df["grade"]

0    very good
1         good
2         good
3    very good
4     very bad
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [97]:
df.sort_values(by='grade')

   id raw_grade      grade
4   5         e   very bad
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good